{
  "add_cross_attention": false,
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ad_hominem",
    "1": "appeal_to_authority",
    "2": "false_cause",
    "3": "false_dilemma",
    "4": "hasty_generalization",
    "5": "none",
    "6": "other",
    "7": "slippery_slope",
    "8": "straw_man"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "ad_hominem": 0,
    "appeal_to_authority": 1,
    "false_cause": 2,
    "false_dilemma": 3,
    "hasty_generalization": 4,
    "none": 5,
    "other": 6,
    "slippery_slope": 7,
    "straw_man": 8
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.5.4",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 50265
}
